# Ваша програма має перенести останній елемент списку з кінця на початок, тобто, останній елемент списку має стати першим. Послідовність інших елементів не має змінюватися.
# Порожній список або список з одним елементом повинен залишитися незмінним.
# Кількість елементів у списку може бути будь-яким – нуль та більше!
# x = []
# x = [1]
# x = [12, 3, 4, 10]
# x = [12, 3, 4, 10, 8]
# Для перевірки коректності роботи Вашого коду використовуйте приклади вище. Робити запит на введення даних від користувача не потрібно.

x = [12, 3, 4, 10, 8, 16]
if len(x) <= 1:
	print(x)
else:
	first = x[0]
	last = x[-1]
	x[0] = last
	x[-1] = first
	print(x)